import re



public = ["페미","냄져","한남","자댕이",'조팔',"씨발",'섹스','개년','개새끼','씹','셋스','느개비','좆','노무현',"느개비",'느금마','니애미','빠구리','시발년'
,'시발새끼','느그앰','느그미','노무혐','빠9리','시발롬','시발련','창년','보빨러','사까시','걸레년','걸레련','보빨','4카시','사카시','봊','보전깨','니미','오피누','오피녀','고무통'
,'이기야','놈딱','북딱','지잡','십색기','십색갸','십색꺄', '일배', '일베', '일간베스트', 'ㅈ같']


hardcore = ["페미","냄져","한남","씨발",'섹스','개년','애미','애비','창녀','홍어','후빨','셋스','시발','보지','잠지','모텔','등신','빨통',"씨팔",'니미','엠창','틀딱','응디','놈현'
,'느금','창년','걸레','보빨','니엄','콘돔',"걸레",'병신','빙신','갈보','섻스','쎅스','ㅅㅂ','ㅈㄹ','족같','붕알','부랄','무현','ㅆㅂ','ㅆ발','니앰','니엄','색기' ,'씨팔', '명지'
, '광명', '광운', '숭실', '인풋', '아웃풋', '아주대', '국숭세단', '국숭명단', '서성한', '스카이', 'ㅂㅅ', '입결', '훌리', '정시', '수시', '이간질', '인하', 'ㅈ밥', 'ㅅ발'
, '아망', '서열', '동아대', '폐륜', '페륜', '영남', '서울시립', '강원대', '잡대', '명문', '건동홍', '자퇴', '경상대', '노무', '태정태세', '쎅끈', '세끈', '섺끈', '출신대학'
, '좋은 학교', '좋은학교', '상주', '훌짓', '씹년', '전두환', '5.18', '땅크', '땅끄', '섹종', '섺종', '단국', '건국', '충남대', '좋은대학', '좋은 대학', '분탕', '허벌'
, '백분위', '홀리']


#만약 필터링이 되면 True, 건전한 글일시 False 반환
def filter_public(text):
	for i in public:
		if re.search(i,text):
			return True
	return False


#만약 필터링이 되면 True, 건전한 글일시 False 반환
def filter_hardcore(text):
	for i in hardcore:
		r1 = re.search(i,text)
		r2 = re.search(i[0] + "." + i[1],text)
		r3 = re.search(i[0] + ".." + i[1],text)
		r4 = re.search(i[0] + "..." + i[1],text)
		if r1 or r2 or r3 or r4:
			return True
	return False